Repository: SkyPixel-Studio/Sparkify
Catalog: Sparkify/Localizable.xcstrings
Source language: zh_hans
Languages: en

# about_sparkify
source: 关于 Sparkify
en: About Sparkify

# add_file
source: 添加文件…
en: Add File…

# add_file_before_sync
source: 请先在附件列表中添加并排序至少一个文件。
en: Please add and sort at least one file in the attachment list first.

# add_file_failed
source: 添加失败
en: Add Failed

# add_files
source: 添加文件…
en: Add Files…

# add_markdown_files_first
source: 请先添加需要同步的 Markdown 文件。
en: Please add Markdown files to sync first.

# added
source: 新增
en: Added

# agent_context_export_warning
source: 检测到代理上下文模板。这类模板的文件关联信息不会被导出,重新导入后需要重新关联本地文件。
en: Agent context templates detected. File association information will not be exported and needs to be re-associated after import.

# agent_context_info_alert_message
source: 代理上下文模板是适用于 Codex、Claude Code 等命令行代理的系统指令文档，储存于文件中。\n\n选取对应文件后，您可以在 Sparkify 内统一管理这些模板。
en: Agent context templates are system instruction documents for command-line agents like Codex and Claude Code, stored in files.\n\nAfter selecting the corresponding file, you can manage these templates uniformly in Sparkify.

# agent_context_info_alert_title
source: 关于代理上下文模板
en: About Agent Context Templates

# all
source: 全部
en: All

# all_tags
source: 所有标签
en: All Tags

# alphabetical_sort
source: 摘要排序
en: Title Sort

# author
source: 作者：%@
en: Author: %@

# body
source: 正文
en: Body

# body_mode_picker
source: 正文模式
en: Mode

# body_template
source: 正文模板
en: Body

# bookmark_creation_failed
source: 无法为 %1$@ 创建书签：%2$@
en: Failed to create bookmark for %@: %@

# bookmark_resolution_failed
source: 文件书签失效：%@
en: File bookmark is invalid: %@

# cancel
source: 取消
en: Cancel

# cannot_sync
source: 无法同步
en: Cannot Sync

# cannot_write_to_clipboard
source: 无法写入剪贴板
en: Cannot write to clipboard

# clear_filters
source: 清空筛选条件
en: Clear Filters

# clear_icon_cache
source: 清理图标缓存
en: Clear Icon Cache

# clone_prompt_success
source: 已克隆 %@
en: Cloned %@

# clone_template
source: 克隆模板
en: Clone Template

# cloned_title_format
source: %@ 副本
en: Copy of %@

# cloned_title_numbered_format
source: %@ 副本 %lld
en: Copy %lld of %@

# close
source: 关闭
en: Close

# collapse_toolbox
source: 收起 Toolbox
en: Collapse Toolbox

# comparison_target
source: 对比目标
en: Comparison Target

# confirmation_reset_parameters
source: 重置参数
en: Reset Parameters

# content_view_picker
source: 内容视图
en: Content View

# continue_dont_remind
source: 继续，下次不再提醒
en: Continue, Don't Remind Again

# continue_editing
source: 继续编辑
en: Continue Editing

# continue_export
source: 继续导出
en: Continue Export

# copied
source: 已复制
en: Copied

# copy
source: 复制
en: Copy

# copy_and_open_toolbox
source: 复制并打开Toolbox
en: Copy and Open Toolbox

# copy_filled_prompt
source: 复制渲染
en: Copy Filled

# copy_template
source: 复制模板
en: Copy Template

# copy_template_only
source: 仅复制模板
en: Copy Template Only

# create_template_failure
source: 无法创建模板
en: Failed to Create Template

# created_agent_context
source: 已创建代理上下文模板
en: Created Agent Context Template

# created_at_format
source: 创建于 %@
en: Created at %@

# created_time_sort
source: 创建时间
en: Created Time

# creation_time
source: 创建时间
en: Creation Time

# current_content
source: 当前内容
en: Current Content

# current_content_subtitle
source: 未保存修改也会纳入比较
en: Unsaved changes included in comparison

# current_language
source: 语言
en: Language

# current_template_count
source: 当前模板数量
en: Current Template Count

# current_value
source: 当前值
en: Current Value

# default_value
source: 默认值
en: Default Value

# default_value_placeholder
source: 留空代表默认不填
en: Leave blank for no default

# delete
source: 删除
en: Delete

# delete_current_template
source: 删除当前模板
en: Delete Current Template

# delete_prompt
source: 删除模板
en: Delete

# delete_prompt_confirm_message
source: 此操作不可撤销，将永久删除该模板及其参数，确定要删除吗？
en: This operation is irreversible and will permanently delete this template and its parameters. Are you sure you want to delete?

# delete_prompt_confirm_title
source: 删除模板？
en: Delete Template?

# delete_prompt_message
source: 此操作不可撤销，将永久删除该模板及其参数，确定要删除吗？
en: This action cannot be undone. The template and all its parameters will be permanently deleted. Are you sure?

# delete_prompt_success
source: 已删除 %@
en: Deleted %@

# delete_prompt_title
source: 删除模板？
en: Delete Template?

# delete_template_confirm
source: 确定要删除「%@」吗？此操作不可撤销。
en: Are you sure you want to delete '%@'? This action cannot be undone.

# developer_options
source: 开发者选项
en: Developer Options

# discard_changes
source: 放弃修改
en: Discard Changes

# discard_changes_confirm_message
source: 取消后当前缓冲的修改会丢失，确定要放弃吗？
en: Canceling will lose all current unsaved changes. Are you sure you want to discard them?

# discard_changes_confirm_title
source: 放弃修改？
en: Discard Changes?

# discard_changes_message
source: 取消后当前缓冲的修改会丢失，确定要放弃吗？
en: All unsaved changes will be lost. Are you sure you want to discard them?

# discard_changes_title
source: 放弃修改？
en: Discard Changes?

# done
source: 完成
en: Done

# edit
source: 编辑
en: Edit

# edit_content
source: 编辑内容
en: Edit Content

# edit_template
source: 编辑模板
en: Edit Template

# empty_body_markdown
source: 正文为空，暂无 Markdown 预览
en: Body is empty, no MD Preview available

# empty_body_no_markdown_preview
source: 正文为空，暂无 Markdown 预览
en: Empty body, no MD Preview

# empty_means_no_default
source: 留空代表默认不填
en: Leave empty for no default

# empty_preview_content
source: 预览内容为空
en: Preview content is empty

# empty_state_create_or_import
source: 先新建一个模板，或者导入 JSON，马上开始复用你的提示词。
en: Create a template first, or import JSON to start reusing your prompts.

# empty_state_no_templates
source: 还没有模板哦
en: No templates yet

# empty_template_content
source: 模板内容为空
en: Template content is empty

# english
source: 英文
en: English

# expand_toolbox
source: 展开 Toolbox
en: Expand Toolbox

# export
source: 导出
en: Export

# export_failure
source: 导出失败
en: Export Failed

# export_hint
source: 导出提示
en: Export Hint

# export_success
source: 导出成功
en: Export Successful

# file_access_denied
source: 没有权限访问 %@。
en: Access denied to %@.

# file_overwrite_failed
source: %@ 覆写失败
en: %@ Overwrite Failed

# file_picker_message
source: 选择一个或多个本地 Markdown 文件。若需显示隐藏文件，请按 [⌘ ⇧ .] 显示隐藏文件。
en: Select one or more local Markdown files. Press [⌘ ⇧ .] to show hidden files.

# file_picker_prompt
source: 选择
en: Select

# file_read_failed
source: 读取 %1$@ 失败：%2$@
en: Failed to read %@: %@

# file_selection_cancelled
source: 用户取消了文件选择。
en: File selection was cancelled.

# file_selection_empty
source: 未选择任何 Markdown 文件。
en: No Markdown files were selected.

# file_sync_failed
source: %@ 同步失败
en: %@ Sync Failed

# file_write_failed
source: 写入 %1$@ 失败：%2$@
en: Failed to write %@: %@

# files_associated
source: 已关联 %lld 个文件
en: Associated %lld file(s)

# filter_by_tag
source: 标签「%@」
en: Tag "%@"

# filter_description
source: 筛选条件：%@
en: Filter conditions: %@

# filter_pinned
source: 置顶
en: Pinned

# filter_search
source: 搜索「%@」
en: Search "%@"

# general_settings
source: 通用设置
en: General

# import
source: 导入
en: Import

# import_failure
source: 导入失败
en: Import Failed

# import_failure_reason_invalid_format
source: JSON 格式无法识别，请确认文件是否由 Sparkify 导出。
en: Invalid JSON format. Please confirm the file was exported by Sparkify.

# import_failure_reason_unsupported_version
source: 不支持的版本：%d。请更新 Sparkify。
en: Unsupported version: %d. Please update Sparkify.

# import_json
source: 导入 JSON
en: Import JSON

# import_success
source: 导入成功：新增 %lld · 更新 %lld
en: Import successful: %lld added · %lld updated

# just_now
source: 刚刚
en: Just now

# keep_retained
source: 保留
en: Retained

# kept
source: 保留
en: Kept

# language_requires_restart
source: 语言更改将在重启应用后生效。
en: Language change will take effect after restarting the app.

# last_updated_relative
source: 最近更新 %@
en: Last updated %@

# linked_files
source: 关联文件
en: Associated Files

# linked_files_count
source: 关联文件：%lld 个
en: Linked files: %lld

# mark_as_milestone
source: 标记为里程碑
en: Mark as Milestone

# markdown_preview
source: Markdown 预览
en: Preview

# milestone
source: 里程碑
en: Milestone

# modified
source: 已更新
en: Updated

# move_down
source: 下移
en: Move Down

# move_up
source: 上移
en: Move Up

# multiline_input
source: 多行输入
en: Multiline

# new_agent_context_template
source: 新建代理上下文模板…
en: New Agent Context Template…

# new_template
source: 新模板
en: New Template

# new_template_button
source: 新建普通模板
en: New Template

# no_change
source: 无变化
en: No changes

# no_default_value_set
source: 未设置默认值，在模板卡片使用时会高亮提示补全。
en: No default value set, will be highlighted for completion in template card.

# no_exportable_templates
source: 没有可导出的模板
en: No Templates to Export

# no_exportable_templates_message
source: 先创建或导入一些模板，再尝试导出吧。
en: Create or import some templates first, then try exporting again.

# no_files_to_overwrite
source: 没有可覆写的文件
en: No Files to Overwrite

# no_files_yet
source: 尚未关联文件。点击"添加文件…"选择一个或多个 Markdown 文件，支持按 ⌘⇧. 显示隐藏文件。
en: No files associated yet. Click 'Add File…' to select one or more Markdown files. Press ⌘⇧. to show hidden files.

# no_linked_files_hint
source: 尚未关联文件。点击"添加文件…"选择一个或多个 Markdown 文件，支持按 ⌘⇧. 显示隐藏文件。
en: No linked files yet. Click "Add Files…" to select one or more Markdown files. Press ⌘⇧. to show hidden files.

# no_params_copy_directly
source: 此模板暂无参数，直接复制即可
en: This template has no parameters, copy directly

# no_templates_in_filter
source: 当前条件下没有模板
en: No templates under current conditions

# no_templates_yet_create_one
source: 还没有模板，先新建一个吧
en: No templates yet, create one

# no_version_history
source: 暂无版本记录
en: No version history yet

# no_version_history_subtitle
source: 保存至少一次模板即可在这里查看版本差异。
en: Save the template at least once to view version differences here.

# no_version_records
source: 暂无版本记录
en: No Version Records Yet

# not_performed
source: 未执行
en: Not performed

# not_pinned
source: 未置顶
en: Not Pinned

# ok
source: 好
en: OK

# open_app_format
source: 打开 %@
en: Open %@

# open_in_browser
source: 在浏览器中打开
en: Open in Browser

# overwrite_failed
source: 覆写失败
en: Overwrite Failed

# overwrite_single_file
source: 仅覆写该文件
en: Overwrite This File Only

# overwrite_success
source: 已覆写 %lld 个文件
en: Overwrote %lld file(s)

# overwrite_to_file
source: 覆写到文件
en: Overwrite

# overwritten_file
source: 已覆写「%@」
en: Overwrote '%@'

# param_default_value
source: 默认值：%@
en: Default value: %@

# param_defaults_description
source: 这里修改的值只影响模板默认配置，不会立即覆盖主页 Workspace 中的实时参数。
en: Values modified here only affect template defaults and will not immediately override live parameters in the Workspace on the main page.

# param_defaults_empty
source: 正文中的 {placeholder} 会自动同步到这里，方便为每个参数配置默认值。
en: {placeholder} in the body will automatically sync here, making it easy to configure default values for each parameter.

# param_modified
source: 已更新
en: Modified

# param_removed
source: 已移除
en: Removed

# param_unchanged
source: 未变化
en: Unchanged

# parameter_defaults
source: 参数默认值
en: Parameter Defaults

# parameters
source: 参数
en: Parameters

# pending_fill
source: 待填写：%@
en: Pending: %@

# pin
source: 置顶
en: Pin

# pin_template
source: 置顶此模板
en: Pin This Template

# pinned
source: 已置顶
en: Pinned

# pinned_templates
source: 置顶的模板
en: Pinned Templates

# preview
source: 预览
en: Preview

# primary_file
source: 主文件
en: Primary File

# privacy_policy
source: 隐私政策
en: Privacy Policy

# quick_actions
source: 快捷操作
en: Quick Actions

# quick_filter
source: 快捷筛选
en: Quick Filter

# read_from_primary_file
source: 从首个关联文件读取内容并刷新模板正文
en: Read content from primary file and refresh template body

# recent_tags
source: 最近使用的标签
en: Recently Used Tags

# recently_updated_format
source: 最近更新 %@
en: Recently updated %@

# recently_updated_prefix
source: 最近更新
en: Updated

# relative_time_ago
source: %@前
en: %@ ago

# remove_attachment
source: 移除附件
en: Remove Attachment

# removed
source: 移除
en: Removed

# removed_attachment
source: 已移除「%@」
en: Removed '%@'

# rename_summary
source: 更改摘要…
en: Rename Abstract…

# rename_summary_description
source: 更新模板摘要会刷新最近修改时间。
en: Updating template summary will refresh the last modified time.

# rename_summary_title
source: 更改摘要
en: Rename Abstract

# reset
source: 重置
en: Reset

# reset_all
source: 重置所有
en: Reset All

# reset_all_params
source: 重置所有参数
en: Reset All Parameters

# reset_all_params_confirm
source: 确定要将所有 %lld 个参数重置为默认值吗？此操作将覆盖所有当前值。
en: Are you sure you want to reset all %lld parameters to their default values? This will overwrite all current values.

# reset_param_confirm
source: 确定要将参数 {%@} 重置为默认值吗？
en: Are you sure you want to reset parameter {%@} to its default value?

# reset_success
source: 重置成功
en: Reset Successful

# reset_success_message
source: 已重置为默认模板
en: Reset to default templates

# reset_to_default
source: 重置为默认值
en: Reset to Default

# reset_to_default_templates
source: 重置为默认模板
en: Reset to Default Templates

# reset_to_default_templates_confirm
source: 此操作将删除所有现有模板，并重新加载默认的种子数据。此操作不可撤销。
en: This operation will delete all existing templates and reload default seed data. This cannot be undone.

# reset_to_system_username
source: 重置为系统用户名
en: Reset to system username

# restore_revision
source: 恢复此版本
en: Restore This Version

# restore_revision_confirm_message
source: 将使用此历史版本覆盖当前内容，并生成新版本记录。此操作不可撤销。
en: This will overwrite current content with this historical version and create a new version record. This cannot be undone.

# restore_revision_confirm_title
source: 恢复此版本？
en: Restore This Version?

# restore_this_version
source: 恢复此版本
en: Restore This Version

# restore_version
source: 恢复版本
en: Restore Version

# restore_version_message
source: 将使用此历史版本覆盖当前内容，并生成新版本记录。此操作不可撤销。
en: This will overwrite current content with this historical version and create a new version record. This action cannot be undone.

# restore_version_title
source: 恢复此版本？
en: Restore This Version?

# save
source: 保存
en: Save

# save_failure
source: 保存失败
en: Save Failed

# save_once_to_see_diff
source: 保存至少一次模板即可在这里查看版本差异。
en: Save the template at least once to view version differences here.

# save_template_changes
source: 保存模板更改
en: Save Template Changes

# saved_all_changes
source: 已保存所有更改
en: Saved all changes

# search_template_menu
source: 搜索模板
en: Search

# search_templates
source: 搜索模板
en: Search

# select_tags
source: 选择标签
en: Select Tag

# select_version_to_compare
source: 请选择左侧某个版本，随后选择你想要比较的目标。默认与当前内容对比。
en: Please select a version on the left, then pick a comparison target. Compares with current content by default.

# set_as_primary
source: 设为首要
en: Set as Primary

# settings
source: 设置
en: Settings

# show_same_tag_templates
source: 显示同标签「%@」的其他模板
en: Show other templates with tag '%@'

# signature
source: 签名
en: Signature

# signature_description
source: 签名将作为版本历史的作者名称。默认使用系统用户名。
en: Signature will be used as the author name in version history. Defaults to system username.

# simplified_chinese
source: 简体中文
en: Simplified Chinese

# summary
source: 摘要
en: Abstract

# switch_to_markdown
source: 切换到 Markdown 预览
en: Switch to MD Preview

# switch_to_multiline
source: 切换到多行模式
en: Switch to Multiline Mode

# switch_to_plain_text
source: 切换到纯文本预览
en: Switch to Plain Text Preview

# switch_to_single_line
source: 切换到单行模式
en: Switch to Single Line Mode

# sync_failed
source: 同步失败
en: Sync Failed

# sync_from_attachment
source: 仅从该文件同步
en: Sync from This File Only

# sync_from_file
source: 已从「%@」同步
en: Synced from '%@'

# sync_from_this_file_only
source: 仅从该文件同步
en: Sync from This File Only

# sync_overwrite_format
source: 同步：%@ · 覆写：%@
en: Sync: %@ · Overwrite: %@

# sync_with_file
source: 与文件同步
en: Sync with File

# system_default
source: 跟随系统
en: Follow System

# tag_filter
source: 标签筛选
en: Tag Filter

# tags
source: 标签
en: Tags

# tags_comma_separated
source: 标签（逗号分隔）
en: Tags (comma separated)

# technical_support
source: 技术支持
en: Technical Support

# template
source: 模板
en: Template

# template_menu
source: 模板
en: Template

# template_summary
source: 模板摘要
en: Template Abstract

# templates
source: 模板
en: Templates

# templates_with_tag
source: 标签「%@」的模板
en: Templates with tag '%@'

# time_ago
source: %@前
en: %@ ago

# time_ago_format
source: %@前
en: %@ ago

# time_info
source: 时间信息
en: Time Info

# time_later_format
source: %@后
en: %@ later

# toggle_milestone
source: 标记为里程碑
en: Mark as Milestone

# toolbox_cherry_studio_summary
source: 本地 LLM 对话客户端，需提前安装
en: Local LLM Chat client, requires prior installation

# toolbox_chatgpt_app_summary
source: OpenAI 官方 macOS 应用，需提前安装
en: OpenAI's official macOS app, requires prior installation

# toolbox_chatgpt_web_summary
source: ChatGPT 网页客户端
en: ChatGPT web client

# toolbox_claude_app_summary
source: Anthropic Claude macOS 应用，需提前安装
en: Anthropic Claude macOS app, requires prior installation

# toolbox_claude_web_summary
source: Claude 网页客户端
en: Claude web client

# toolbox_deepseek_summary
source: DeepSeek 网页客户端
en: DeepSeek web client

# toolbox_description
source: 启用后，模板列表右下角会出现 toolbox 按钮，可快速打开所选的 AI 助手或网页。
en: When enabled, a toolbox button appears in the bottom right of the template list for quick access to selected AI assistants or webpages.

# toolbox_doubao_name
source: 豆包
en: Doubao

# toolbox_doubao_summary
source: ByteDance 豆包大模型 网页客户端
en: ByteDance Doubao LLM web client

# toolbox_flowdown_name
source: 浮望
en: FlowDown

# toolbox_flowdown_summary
source: 本地 LLM 对话客户端，需提前安装
en: Local LLM Chat client, requires prior installation

# toolbox_gemini_summary
source: Google Gemini 网页客户端
en: Google Gemini web client

# toolbox_google_ai_studio_summary
source: Google AI Studio 网页客户端，可以访问更多 Google DeepMind 模型
en: Google AI Studio web client, access more Google DeepMind models

# toolbox_grok_summary
source: xAI Grok 网页客户端
en: xAI Grok web client

# toolbox_quick_access
source: Toolbox 快捷入口
en: Toolbox Quick Access

# toolbox_qwen_summary
source: Qwen 网页客户端
en: Qwen web client

# toolbox_tongyi_qwen_name
source: 通义千问
en: Tongyi Qwen

# toolbox_tongyi_qwen_summary
source: 通义千问（中国大陆） 网页客户端
en: Tongyi Qwen (Mainland China) web client

# unchanged
source: 未变化
en: Unchanged

# unmark_milestone
source: 取消里程碑标记
en: Unmark Milestone

# unnamed
source: 未命名
en: Unnamed

# unnamed_template
source: 未命名模板
en: Unnamed Template

# unpin
source: 取消置顶
en: Unpin

# unpin_template
source: 取消置顶
en: Unpin This Template

# unpinned
source: 未置顶
en: Not Pinned

# unsaved_changes_included
source: 未保存修改也会纳入比较
en: Unsaved changes included in comparison

# update_time
source: 更新时间
en: Update Time

# updated_time_sort
source: 更新时间
en: Updated Time

# version
source: 版本
en: Version

# version_history
source: 版本历史
en: Version History

# version_history_description
source: 左侧选择要查看的版本，再挑选对比对象。默认与当前内容对比。右键点击版本可标记为里程碑，里程碑版本永久保留不会被自动清理。
en: Select a version on the left, then pick a comparison target. Defaults to comparing with current content. Right-click a version to mark it as a milestone; milestone versions are permanently retained and won't be automatically cleaned up.

# version_history_instructions
source: 左侧选择要查看的版本，再挑选对比对象。默认与当前内容对比。右键点击版本可标记为里程碑，里程碑版本永久保留不会被自动清理。
en: Select a version on the left, then pick a comparison target. Compares with current content by default. Right-click versions to mark as milestones; milestone versions are preserved permanently.

# view_more_settings
source: 查看更多设置
en: View More Settings

# write_back_to_all_files
source: 将模板正文写回所有关联文件
en: Write template body back to all associated files
